
## Plan Result (portfolio/domains)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2937203251)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.certificate.aws_acm_certificate.this
  * module.certificate.aws_acm_certificate_validation.this
  * module.certificate.aws_route53_record.this[&#34;portfolio.tqer39.com&#34;]
  * module.root_domain.aws_route53_zone.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.certificate.aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "portfolio.tqer39.com"
      + domain_validation_options = [
          + {
              + domain_name           = "portfolio.tqer39.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "portfolio.tqer39.com",
        ]
      + tags_all                  = {
          + "pl:environment" = "portfolio"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/domains"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.certificate.aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.certificate.aws_route53_record.this["portfolio.tqer39.com"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z06214013NHDRV3ZS2J57"
    }

  # module.root_domain.aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "portfolio.tqer39.com"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "pl:environment" = "portfolio"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/domains"
        }
      + zone_id       = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":144,"Program":"tfcmt","SHA1":"c79708182080c6b5acc6c16a87dbb633fb7c4672","Target":"portfolio/domains","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->